external/Внешние/src/ExternalDataProcessors/ВыгрузкаДистрибьютора/ВыгрузкаДистрибьютора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ВыгрузкаДистрибьютора</name>
  <comment>(ver 1.20.0.0)</comment>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодДистрибьютора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогНаСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольФТП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассивныйРежимФТП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательФТП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверФТП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЛога</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключениеУстановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьФТПСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КолвоДнейВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопРеквизитКоэффициентаПересчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВыгрузки</name>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПроизвольногоЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборДанных</name>
  </attributes>
  <attributes>
    <name>ПараметрыЗапроса</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружаемыеДанные</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабОстатки</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабПродажи</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>НачПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьАдресДоставкиКакТТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстаткиПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабОплатыКлиентов</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрофМодуль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиАгентов</name>
  </attributes>
  <attributes>
    <name>ВыгрузкаТорговыхТочек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаКонтрагентов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьДополнительнуюВыгрузкуПоЗапросу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольРезервногоФТП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассивныйРежимРезервногоФТП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательРезервногоФТП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверРезервногоФТП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогНаРезервномСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключениеУстановленоРезервногоФТП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АгентИзДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>v2ФорматВыгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортФТП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортРезервногоФТП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

external/Внешние/src/ExternalDataProcessors/ВыгрузкаДистрибьютора/Forms/НастройкиОпциональные/Module.bsl
&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Результат = Новый Структура;	
	
	Результат.Вставить("ВыгрузкаТорговыхТочек", ВыгрузкаТорговыхТочек);
	Результат.Вставить("ВыгрузкаКонтрагентов", ВыгрузкаКонтрагентов);	
	Результат.Вставить("v2ФорматВыгрузки", v2ФорматВыгрузки);
	Результат.Вставить("ИмпортНастроек", ИмпортНастроек);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыгрузкаТорговыхТочек = Параметры.ВыгрузкаТорговыхТочек;
	ВыгрузкаКонтрагентов = Параметры.ВыгрузкаКонтрагентов;
	v2ФорматВыгрузки = Параметры.v2ФорматВыгрузки;
	
	Если Параметры.Конфигурация = "Розница" Тогда
		
		Элементы.ВыгрузкаТорговыхТочек.СписокВыбора.Очистить();
		Элементы.ВыгрузкаКонтрагентов.СписокВыбора.Очистить();
				
		// "Адрес" по "ВыгружатьАдресДоставкиКакТТ"
		Элементы.ВыгрузкаТорговыхТочек.СписокВыбора.Добавить("Склад");
		Элементы.ВыгрузкаТорговыхТочек.СписокВыбора.Добавить("Осутствует");
		
		Элементы.ВыгрузкаКонтрагентов.СписокВыбора.Добавить("Контрагенты");
		
	ИначеЕсли Параметры.Конфигурация = "БП" Тогда
		
		Элементы.ВыгрузкаТорговыхТочек.СписокВыбора.Очистить();
	    Элементы.ВыгрузкаКонтрагентов.СписокВыбора.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИмпортНастроекНаСервере(ддНастроек, ддОбработки)
	
	АдресОбработки  = ПоместитьВоВременноеХранилище(ддОбработки);
	
	ИмяОбработки = ВнешниеОбработки.Подключить(АдресОбработки);
	МенеджерНастроек = ВнешниеОбработки.Создать(ИмяОбработки);
	
	Попытка
		ИмпортНастроек = МенеджерНастроек.ЗагрузитьНастройки(ддНастроек)
	Исключение
		ИмпортНастроек = Неопределено
	КонецПопытки;
	
	Возврат ТипЗнч(ИмпортНастроек) = Тип("Структура")
	
КонецФункции

&НаКлиенте
Процедура ИмпортНастроек(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПарольФТП)
		Или НЕ ЗначениеЗаполнено(ПользовательФТП) Тогда
		Сообщить(НСтр("ru = 'Укажите ФТП доступы к обработке импорта настроек'"));	
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Заголовок		= "Укажите файл настроек";
	//Диалог.Фильтр			= "Настройки|*.settings";
	//Диалог.Расширение		= ".settings";
		
	Если Диалог.Выбрать() Тогда
		
		ддНастроек = Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла);
		
		//Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
		//Диалог.Заголовок		= "Выберите обработку чтения настроек ""UnloadDistrSettings""";
		//Диалог.Фильтр			= "Обработчка|*.epf";
		//Диалог.ПолноеИмяФайла	= "UnloadDistrSettings";
		//Диалог.Расширение		= ".epf";
		//
		//Если Диалог.Выбрать() Тогда
		//	
		//	ддОбработки = Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла);
		//	
		//	Если ИмпортНастроекНаСервере(ддНастроек, ддОбработки) Тогда
		//		Элементы.Декорация1.Видимость = Истина;	
		//	КонецЕсли;						
		//КонецЕсли;
		
		ОбработатьНастройкиНаСервере(ддНастроек, ПользовательФТП, ПарольФТП)
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработатьНастройкиНаСервере(ддНастроек, ПользовательФТП, ПарольФТП)
	
	Попытка
		ПодключениеКФТП = Новый FTPСоединение(
			"192.168.100.122", 
			15100,
			ПользовательФТП,
			ПарольФТП,
			,
			Истина,
			60,
			Новый ЗащищенноеСоединениеOpenSSL(),
			УровеньИспользованияЗащищенногоСоединенияFTP.ИспользоватьЕслиВозможно);
	Исключение				
		Сообщить("Ошибка подключения. Причина: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки; 
	
	Если ТипЗнч(ПодключениеКФТП) = Тип("FTPСоединение") Тогда
		
		Попытка
			КаталогНаСервереFTP = "/temp";
			
			Если ЗначениеЗаполнено(КаталогНаСервереFTP) Тогда
				
				Если ПодключениеКФТП.НайтиФайлы(КаталогНаСервереFTP).Количество() = 0 тогда
					ПодключениеКФТП.СоздатьКаталог(КаталогНаСервереFTP);			
				КонецЕсли;
				ПодключениеКФТП.УстановитьТекущийКаталог(КаталогНаСервереFTP);
				
			КонецЕсли;
			
			МассивФайлов = ПодключениеКФТП.НайтиФайлы(КаталогНаСервереFTP, "UnloadDistrSettings.epf");
			
			Если НЕ МассивФайлов.Количество() = 1 Тогда
				
				Сообщить(НСтр("ru = 'Файлы обработки ""UnloadDistrSettings.epf"" не найдены.'"));				
				Возврат;
				
			Иначе					
				ВремФайлОбработки = ПолучитьИмяВременногоФайла();
				
				ПодключениеКФТП.Получить(МассивФайлов[0].ПолноеИмя, ВремФайлОбработки);
				
				ддОбработки = Новый ДвоичныеДанные(ВремФайлОбработки);
				
				Если ИмпортНастроекНаСервере(ддНастроек, ддОбработки) Тогда
					Элементы.Декорация1.Видимость = Истина;	
				КонецЕсли;
				
				УдалитьФайлы(ВремФайлОбработки);
				
			КонецЕсли;
			
		Исключение	
			Сообщить(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка поиска файлов на FTP по причине: %1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));			
		КонецПопытки;									
	КонецЕсли;
	
КонецПроцедуры
